Public Attributes | List of all members
API_AnalyticalLoadGroup Struct Reference
Analytical Model
Describes a Structural Analytical Load Group. More...
#include <APIdefs_AnalyticalModel.h>
 Public Attributes
 GS::UniString  | name
Name of the load group.
 API_AnalyticalLoadGroupType  | groupType
Group type of the load group.
 API_AnalyticalLoadGroupRelation  | relation
Relation of the load cases in the load group.
 GS::UniString  | loadType
Load type of the load group.
 API_Guid  | guid
A unique identifier of the represented load group.
Detailed Description
Describes a Structural Analytical Load Group.
Since
Archicad 25